; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-90)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 - object)
 (:init 
    (arm-empty)
    (clear b20)
    (on b20 b16)
    (on b16 b9)
    (on b9 b5)
    (on b5 b10)
    (on b10 b19)
    (on b19 b15)
    (on b15 b2)
    (on b2 b24)
    (on b24 b22)
    (on b22 b3)
    (on b3 b1)
    (on b1 b21)
    (on b21 b23)
    (on b23 b27)
    (on b27 b12)
    (on b12 b11)
    (on b11 b17)
    (on-table b17)
    (clear b4)
    (on-table b4)
    (clear b14)
    (on b14 b18)
    (on b18 b25)
    (on b25 b13)
    (on b13 b7)
    (on b7 b26)
    (on b26 b6)
    (on b6 b8)
    (on-table b8))
 (:goal (and 
(on b20 b6)
))
)

; plan
1. (unstack b14 b18)
   deleted: (on b14 b18) (clear b14) (arm-empty)
   added: (holding b14) (clear b18)
   goals met: 0 of 1
2. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 0 of 1
3. (unstack b18 b25)
   deleted: (on b18 b25) (clear b18) (arm-empty)
   added: (holding b18) (clear b25)
   goals met: 0 of 1
4. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 0 of 1
5. (unstack b25 b13)
   deleted: (on b25 b13) (clear b25) (arm-empty)
   added: (holding b25) (clear b13)
   goals met: 0 of 1
6. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 0 of 1
7. (unstack b13 b7)
   deleted: (on b13 b7) (clear b13) (arm-empty)
   added: (holding b13) (clear b7)
   goals met: 0 of 1
8. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 0 of 1
9. (unstack b7 b26)
   deleted: (on b7 b26) (clear b7) (arm-empty)
   added: (holding b7) (clear b26)
   goals met: 0 of 1
10. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 0 of 1
11. (unstack b26 b6)
   deleted: (on b26 b6) (clear b26) (arm-empty)
   added: (holding b26) (clear b6)
   goals met: 0 of 1
12. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 0 of 1
13. (unstack b20 b16)
   deleted: (on b20 b16) (clear b20) (arm-empty)
   added: (holding b20) (clear b16)
   goals met: 0 of 1
14. (stack b20 b6)
   deleted: (clear b6) (holding b20)
   added: (arm-empty) (clear b20) (on b20 b6)
   goals met: 1 of 1
